Revit 2027 API
IDuctFittingAndAccessoryPressureDropUIServer.ShowSettings Method
 Shows the settings UI.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData data
)
Function ShowSettings (
	data As DuctFittingAndAccessoryPressureDropUIData
) As Boolean
bool ShowSettings(
	DuctFittingAndAccessoryPressureDropUIData^ data
)
abstract ShowSettings :
        data : DuctFittingAndAccessoryPressureDropUIData -> bool
Parameters
data DuctFittingAndAccessoryPressureDropUIData
 The input data of the calculation.
Return Value
Boolean
 True if the user makes any changes in the UI, false otherwise.
See Also
Reference
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace